ErpTest/src/Catalogs/уатПараметрыВыработки/уатПараметрыВыработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПараметрыВыработки</name>
  <comment>(уат)</comment>
  <predefined>
    <items>
      <name>ВесГруза</name>
      <description>Вес груза</description>
    </items>
    <items>
      <name>ВремяВНаряде</name>
      <description>Время в наряде</description>
    </items>
    <items>
      <name>ВремяВПростое</name>
      <description>Время в простое</description>
    </items>
    <items>
      <name>ВремяВПростоеСВклДвигателем</name>
      <description>Время в простое с вкл двигателем</description>
    </items>
    <items>
      <name>ВремяВРаботе</name>
      <description>Время в работе</description>
    </items>
    <items>
      <name>ВремяВРаботеПоДаннымGPS</name>
      <description>Время в работе по данным GPS</description>
    </items>
    <items>
      <name>ВремяВРемонте</name>
      <description>Время в ремонте</description>
    </items>
    <items>
      <name>ВремяДневное</name>
      <description>Время дневное</description>
    </items>
    <items>
      <name>ВремяНочное</name>
      <description>Время ночное</description>
    </items>
    <items>
      <name>ВремяПраздничное</name>
      <description>Время праздничное</description>
    </items>
    <items>
      <name>ВремяСпециальнойРаботы</name>
      <description>Время специальной работы</description>
    </items>
    <items>
      <name>КоличествоДней</name>
      <description>Количество дней</description>
    </items>
    <items>
      <name>КоличествоЕздок</name>
      <description>Количество ездок</description>
    </items>
    <items>
      <name>КоличествоОпераций</name>
      <description>Количество операций</description>
    </items>
    <items>
      <name>КоличествоПассажиров</name>
      <description>Количество пассажиров</description>
    </items>
    <items>
      <name>КоличествоРейсов</name>
      <description>Количество рейсов</description>
    </items>
    <items>
      <name>КоличествоТС</name>
      <description>Количество ТС</description>
    </items>
    <items>
      <name>ОбъемКм</name>
      <description>м3 км</description>
    </items>
    <items>
      <name>Объем</name>
      <description>Объем груза</description>
    </items>
    <items>
      <name>ПогрузочноРазгрузочныеРаботы</name>
      <description>Погрузочно разгрузочные работы</description>
    </items>
    <items>
      <name>Подача</name>
      <description>Подача</description>
    </items>
    <items>
      <name>ПробегНаБуксире</name>
      <description>Пробег на буксире</description>
    </items>
    <items>
      <name>ПробегОбщий</name>
      <description>Пробег общий</description>
    </items>
    <items>
      <name>ПробегОбщийПоДаннымGPS</name>
      <description>Пробег общий по данным GPS</description>
    </items>
    <items>
      <name>ПробегПорожний</name>
      <description>Пробег порожний</description>
    </items>
    <items>
      <name>ПробегСГрузом</name>
      <description>Пробег с грузом</description>
    </items>
    <items>
      <name>ПробегСПассажирами</name>
      <description>Пробег с пассажирами</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы</name>
      <description>Пробег специальной работы</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы2</name>
      <description>Пробег специальной работы 2</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы3</name>
      <description>Пробег специальной работы 3</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы4</name>
      <description>Пробег специальной работы 4</description>
    </items>
    <items>
      <name>ПробегСпециальнойРаботы5</name>
      <description>Пробег специальной работы 5</description>
    </items>
    <items>
      <name>ПростойПодПогрузкой</name>
      <description>Простой под погрузкой</description>
    </items>
    <items>
      <name>ПростойПодРазгрузкой</name>
      <description>Простой под разгрузкой</description>
    </items>
    <items>
      <name>ТнКм</name>
      <description>Тн км</description>
    </items>
  </predefined>
  <attributes>
    <name>АлгоритмРасчетаПараметра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаТС</name>
    <comment>Действует на ТС</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетНаСотрудников</name>
    <comment>Действует на сотрудников</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВТарифахНаУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляДокументов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Временный</name>
    <comment>Признак того, что параметр временной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПараметровВыработки</name>
    <type>
      <types>EnumRef.уатСпособРасчетаПараметровВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПоказателиНаработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПоНомеруЭтапа</name>
    <comment>0 - суммировать значения, 1 - выбирать максимальное значение</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Catalogs/уатПараметрыВыработки/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	мсвЗапрещенныеКВыбору = Новый Массив();
	
	Если Не Константы.уатИспользоватьDynafleet.Получить()
			И Не Константы.уатИспользоватьOmnicomm.Получить()
			И Не Константы.уатИспользоватьPositionReport.Получить()
			И Не Константы.уатИспользоватьАвтоГРАФ.Получить()
			И Не Константы.уатИспользоватьАвтотрекер.Получить()
			И Не Константы.уатИспользоватьСКАУТ.Получить()
			И Не Константы.уатИспользоватьЦСМ.Получить() Тогда 
		мсвЗапрещенныеКВыбору.Добавить(Справочники.уатПараметрыВыработки.ПробегОбщийПоДаннымGPS);
		мсвЗапрещенныеКВыбору.Добавить(Справочники.уатПараметрыВыработки.ВремяВРаботеПоДаннымGPS);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос();
	
	Запрос.УстановитьПараметр("ЗапрещенныеКВыбору", мсвЗапрещенныеКВыбору);
	Запрос.УстановитьПараметр("СтрокаПодбора", "" + Параметры.СтрокаПоиска + "%");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	уатПараметрыВыработки.Ссылка,
	|	уатПараметрыВыработки.Наименование
	|ИЗ
	|	Справочник.уатПараметрыВыработки КАК уатПараметрыВыработки
	|ГДЕ
	|	НЕ уатПараметрыВыработки.Ссылка В (&ЗапрещенныеКВыбору)
	|	И уатПараметрыВыработки.Наименование ПОДОБНО &СтрокаПодбора
	|	И %__ДопПараметры__%";
	
	ДопОтборы = "";
	Если Параметры.Свойство("Отбор") И Не Параметры.Отбор = Неопределено Тогда  
		Сч = 1;
		Для Каждого ТекОтбор Из Параметры.Отбор Цикл 
			ДопОтборы = ДопОтборы + ?(ДопОтборы="",""," И ") + "уатПараметрыВыработки." + ТекОтбор.Ключ 
				+ " = &Парам" + Формат(Сч, "ЧН=0; ЧГ=0");
			Запрос.УстановитьПараметр("Парам" + Формат(Сч, "ЧН=0; ЧГ=0"), ТекОтбор.Значение);
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если ДопОтборы = "" Тогда 
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%__ДопПараметры__%", "ИСТИНА");
	Иначе 
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "%__ДопПараметры__%", ДопОтборы);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеВыбора = Новый СписокЗначений();
	
	Пока Выборка.Следующий() Цикл 
		врПозицияОтсечения = СтрДлина(Параметры.СтрокаПоиска);
		тПредставление = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(Лев(Выборка.Наименование, врПозицияОтсечения),, WebЦвета.Красный), 
			Новый ФорматированнаяСтрока(Прав(Выборка.Наименование, СтрДлина(Выборка.Наименование)-врПозицияОтсечения)));
		ДанныеВыбора.Добавить(Выборка.Ссылка, тПредставление);
	КонецЦикла;
	
КонецПроцедуры
